tap "alehouse/unofficial"
tap "aquasecurity/trivy"
tap "bakks/bakks"
tap "charmbracelet/tap"
tap "eddieantonio/eddieantonio"
tap "gbeine/java"
tap "heroku/brew"
tap "hpedrorodrigues/tools"
tap "iterative/dvc"
tap "jonof/kenutils"
tap "jzaleski/jzaleski"
tap "knqyf263/pet"
tap "melonamin/formulae"
tap "ngrok/ngrok"
tap "oven-sh/bun"
tap "proinsias/yaml-update-last-modified-date"
tap "teamookla/speedtest"
tap "vitorgalvao/tiny-scripts"
{{ if eq .chezmoi.os "darwin" }}
tap "tsonglew/dutis"
{{ if .work }}
tap "withgraphite/tap"
{{ end }}{{/* darwin .work */}}
{{ end }}{{/* darwin */}}

# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Simple, modern, secure file encryption
brew "age"
# GNU compiler collection
brew "gcc"
# AI pair programming in your terminal
brew "aider"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Simple system information tool written in Python
brew "archey4"
# Spell checker with better logic than ispell
brew "aspell"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Security-oriented static analyser for Python code
brew "bandit"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# New way to see and navigate directory trees
brew "broot"
# Bash completion for Bundler
brew "bundler-completion"
# Asynchronous DNS library
brew "c-ares"
# Insanely fast image printing in your terminal
brew "catimg"
# Object-file caching compiler wrapper
brew "ccache"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Prevent cloud misconfigurations during build-time for IaC tools
brew "checkov"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cross-platform make
brew "cmake"
# Color-highlighted diff(1) output
brew "colordiff"
# Utility that creates projects from templates
brew "cookiecutter"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Platform built on V8 to build network applications
brew "node"
# Spell checker for code
brew "cspell"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Network intrusion prevention and detection system
brew "daq"
# DuckDuckGo from the terminal
brew "ddgr"
# Enterprise friendly way of detecting and preventing secrets in code
brew "detect-secrets"
# File comparison utilities
brew "diffutils"
# Tool for exploring each layer in a docker image
brew "dive"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Clean Docker containers, images, networks, and volumes
brew "docker-clean"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Lightning-fast linter for .env files written in Rust
brew "dotenv-linter"
# .NET Core
brew "dotnet"
# Git for data science projects
brew "dvc"
brew "editorconfig"
# Tool to verify that your files are in harmony with your .editorconfig
brew "editorconfig-checker"
# Useful examples at the command-line
brew "eg-examples"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Open-source framework for augmenting humans using AI
brew "fabric-ai"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Utility to determine file types
brew "file-formula"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Graphics library to dynamically manipulate images
brew "gd"
# GNU debugger
brew "gdb"
# GNU database manager
brew "gdbm"
# Bash completion for gem
brew "gem-completion"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git-powered FTP client
brew "git-ftp"
# Git extension for versioning large files
brew "git-lfs"
# Compute various size metrics for a Git repository
brew "git-sizer"
# Git extension to generate reports for standup meetings
brew "git-standup"
# High-level command-line interface for Git
brew "git-town"
# Audit git repos for secrets
brew "gitleaks"
# Linting for your git commit messages
brew "gitlint"
# OpenGL to PostScript printing library
brew "gl2ps"
# Alternative to top/htop
brew "glances"
# Render markdown on the CLI
brew "glow"
# Library for Linear and Mixed-Integer Programming
brew "glpk"
# Command-line option parsing utility
brew "gnu-getopt"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU implementation of time utility
brew "gnu-time"
# GNU unit conversion tool
brew "gnu-units"
# GNU implementation of which utility
brew "gnu-which"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Spell checker and morphological analyzer
brew "hunspell"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Apply a diff file to an original
brew "gpatch"
# Image processing tools collection
brew "graphicsmagick"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Colorize logfiles and command output
brew "grc"
# GNU grep, egrep and fgrep
brew "grep"
# Graphical user interface for smartctl
# brew "gsmartcontrol"
# Development kit for the Java programming language
brew "openjdk"
# Google web toolkit
# brew "gwt"
# Popular GNU data compression program
brew "gzip"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Access DVDs as block devices without the decryption
brew "libdvdcss"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake", link: false
# Checks presence of various command-line tools and their versions on the path
brew "has"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie", link: false
# Add GitHub support to git on the command-line
brew "hub"
# Improved colored diff
brew "icdiff"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Sort Python imports automatically
brew "isort"
# Utility to optimize JPEG files
brew "jpegoptim"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Copy/paste detector for programming source code
brew "jscpd"
# JSON parser and validator with a CLI
brew "jsonlint"
# User-friendly front-end to ssh-agent(1)
brew "keychain"
# Detect vulnerabilities, compliance issues, and misconfigurations
brew "kics"
# Style and grammar checker
brew "languagetool"
# Add indentation to LaTeX files
brew "latexindent"
# Bash completion for Launchctl
brew "launchctl-completion"
# Pager program similar to more
brew "less"
# Portable low-level networking library
brew "libdnet"
# Portable Foreign Function Interface library
brew "libffi"
# JIT library for the GNU compiler collection
brew "libgccjit"
# VisualOn AAC encoder library
brew "libvo-aacenc"
# Access large language models from the command-line
brew "llm"
# Rainbows and unicorns in your console!
brew "lolcat"
# Utility to list open files
brew "lsof"
# Fast, async, resource-friendly link checker
brew "lychee"
# Text-based web browser
brew "lynx"
# LZMA-based compression program similar to gzip or bzip2
brew "lzip"
# Keep your Mac's application settings in sync
brew "mackup"
# Utility for directing compilation
brew "make"
# Creates dependencies in makefiles
brew "makedepend"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Project documentation with Markdown
brew "mkdocs"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Remote terminal application
brew "mosh"
# Lightweight PDF and XPS viewer
brew "mupdf"
# Experimental optional static type checker for Python
brew "mypy"
# Open source relational database management system
brew "mysql"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Port scanning utility for large networks
brew "nmap"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# PNG file optimizer
brew "optipng"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Search PDFs for strings matching a regular expression
brew "pdfgrep"
# Bash completion for Pip
brew "pip-completion"
# Locking and sync for Pip requirements files
brew "pip-tools"
# Execute binaries from Python packages in isolated environments
# brew "pipx"  # Use uvx instead.
# C/C++ function library for exporting 2-D vector graphics
brew "plotutils"
# Optimizer for PNG files
brew "pngcrush"
# PNG image optimizing utility
brew "pngquant"
# Send emails from your terminal
brew "pop"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Framework for managing multi-language pre-commit hooks
# brew "pre-commit"  # Install pre-commit-uv instead.
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Linter for prose
brew "proselint"
# Monitor data's progress through a pipe
brew "pv"
# Simple Python style checker in one Python file
brew "pycodestyle"
# Python version management
# brew "pyenv"
# Make Python build faster, using the leverage of `ccache`
# brew "pyenv-ccache"
# It's not just a linter that annoys you!
brew "pylint"
# Python bindings for v6 of Qt
brew "pyqt"
# Static type checker for Python
brew "pyright"
# Tab completion for Python argparse
brew "python-argcomplete"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Upgrade syntax for newer versions of Python
brew "pyupgrade"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Viewer for ReStructuredText documents that renders them on the fly
brew "restview"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Prevent committing secret keys into your source code
brew "ripsecrets"
# ReStructuredText linter
brew "rst-lint"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Bash completion for Ruby
brew "ruby-completion"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Rust toolchain installer
brew "rustup"
# Checks Python dependencies for known vulnerabilities and suggests remediations
brew "safety"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch"
# Bash syntax highlighter that encourages/fixes variables quoting
brew "shellharden"
# Autoformat shell script source code
brew "shfmt"
# Tool to create Python bindings for C and C++ libraries
brew "sip"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Command-line utility for posting snippets to Slack
brew "slackcat"
# Convert filenames and directories to a web friendly format
brew "slugify"
# Flexible Network Intrusion Detection System
brew "snort"
# Bash completion for Sonar
brew "sonar-completion"
# SOund eXchange: universal sound sample translator
brew "sox"
# SQL linter to do sanity checks on your queries and bring errors back from the DB
brew "sql-lint"
# SQL linter and auto-formatter for Humans
brew "sqlfluff"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Tool to impose load on and stress test a computer system
brew "stress"
# Suite of Sparse Matrix Software
brew "suite-sparse"
# Rich and complete approach to parallelism in C++
brew "tbb"
# Command-line packet analyzer
brew "tcpdump"
# Convert TeXinfo files to HTML
brew "texi2html"
# Official documentation format of the GNU project
brew "texinfo"
# Implementation of the Language Server Protocol for LaTeX
brew "texlab"
# Programmatically correct mistyped console commands
brew "thefuck"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# Text interface for Git repositories
brew "tig"
# Convert .tivo to .mpeg
brew "tivodecode"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Shell completion for Tmuxinator
brew "tmuxinator-completion"
# Program that allows you to count code, quickly
brew "tokei"
# Upgrade all the things
brew "topgrade"
# Terminal interaction recorder and player
brew "ttyrec"
# Converts a ttyrec file into gif files
brew "ttygif"
# Extraction utility for .zip compressed archives
brew "unzip"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Your CLI home video recorder
brew "vhs"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Display word differences between text files
brew "wdiff"
# Internet file retriever
brew "wget"
# Homebrew, but with Docker images
brew "whalebrew"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Automatic workarounds for problems in Wine
brew "winetricks"
# Access X11 clipboards from the command-line
brew "xclip"
# Extensible command-line tool to format YAML files
brew "yamlfmt"
# Linter for YAML files
brew "yamllint"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Scanner for vulnerabilities in container images, file systems, and Git repositories, as well as for configuration issues
brew "aquasecurity/trivy/trivy"
# AI on the command line
brew "charmbracelet/tap/mods"
# A tool for recording terminal GIFs
brew "charmbracelet/tap/vhs"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Set the last modified date in YAML front matter of edited markdown files
brew "proinsias/yaml-update-last-modified-date/yaml-update-last-modified-date"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Quickly repair outdated/broken Casks from homebrew-cask
brew "vitorgalvao/tiny-scripts/cask-repair"
# It's like cat(1), but for images
brew "eddieantonio/eddieantonio/imgcat"
# Ken Silverman's PNG optimisation utility
brew "jonof/kenutils/pngout"
# Simple command-line snippet manager
brew "knqyf263/pet/pet"

{{ if eq .chezmoi.os "darwin" }}{{/* darwin */}}

# Select default apps for documents and URL schemes on macOS
brew "duti"
# A cmd util to manage default app on macOS, inspired by duti
brew "dutis"
# CLI for ImageOptim, ImageAlpha and JPEGmini
brew "imageoptim-cli"
# Mac App Store command-line interface
brew "mas"
# Bash completion for open
brew "open-completion"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# GNU Fortran compatibility for Apple's vecLib
brew "veclibfort"
# Show the current WiFi network password
brew "wifi-password"
# A tool for using LLMs on the command line
brew "bakks/bakks/butterfish"
# Automatic Password Generator
brew "jzaleski/jzaleski/apg"

{{ if not .test }}{{/* darwin not .test */}}
vscode "bierner.markdown-mermaid"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "innoverio.vscode-dbt-power-user"
vscode "iterative.dvc"
vscode "iterative.vscode-dvc-pack"
vscode "kenhowardpdx.vscode-gist"
# vscode "mkhl.direnv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "njpwerner.autodocstring"
vscode "openai.chatgpt"
vscode "quarto.quarto"
vscode "redhat.vscode-yaml"
vscode "thisotherthing.vscode-todo-list"
vscode "wakatime.vscode-wakatime"
{{ end }}{{/* darwin not .test */}}

{{ if not .work }}{{/* darwin not .work */}}
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Data backup and storage service
cask "backblaze"
# Web browser
cask "firefox"
# Set of CPU, memory, disk, and network monitoring tools
cask "menumeters"
# Scheduling application focusing on organisation
cask "omnifocus"
# Control your tools with a few keystrokes
cask "raycast"
# Drive failure monitoring tool
cask "smartreporter-free"
# Mesh VPN based on WireGuard
cask "tailscale-app"
cask "wezterm"

{{ if not .lite }}{{/* darwin not .work not .lite*/}}
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Apple TV Aerial screensaver
cask "aerial"
# Memory training application
# cask "anki"
# App for quickly limiting CPU usage of any running process
cask "apppolice"
# Download Backblaze restored files more reliably
cask "backblaze-downloader"
# Menu bar icon organiser
# cask "bartender"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Text, code, and markup editor
# cask "bbedit"
# Tool to customise input devices and automate computer systems
# cask "bettertouchtool"
# Utility to create and modify archives
cask "betterzip"
# 3D creation suite
cask "blender"
# Cloud based collaboration and management platform focusing on security
# cask "box-sync"
# Web browser focusing on privacy
cask "brave-browser"
# Open source IDE for exploring and testing APIs
cask "bruno"
# E-books management software
cask "calibre"
# Use your phone as a high-quality webcam with image tuning controls
cask "camo-studio"
# Tool to list all active shortcuts of the current application
# cask "cheatsheet"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Disk space visualiser
# cask "daisydisk"
# API documentation browser and code snippet manager
cask "dash"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Drive health diagnostic & monitoring tool
# cask "drivedx"
# Client for the Dropbox cloud storage service
# cask "dropbox"
# Web browser focusing on privacy
cask "duckduckgo"
# Store securely encrypted backups in the cloud
cask "duplicati"
# Swiss army knife of text transformation for iOS and macOS
cask "esse"
# Screen colour temperature controller
cask "flux-app"
cask "font-jetbrains-mono-nerd-font"
cask "font-ntr"
# cask "font-rubik"
# Amiga emulator
# cask "fs-uae-emulator"
# Amiga emulator launcher
# cask "fs-uae-launcher"
# Gantt chart and project management application
# cask "ganttproject"
# Open-source platform for visualizing and manipulating large graphs
cask "gephi"
# Free and open-source image editor
cask "gimp"
# Scan computer disk for 32-bit applications
# cask "go64"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Tools to protect your files
cask "gpg-suite-no-mail"
# Utility to fix grammar errors and style issues in text
cask "grammarly-desktop"
# Graphically shows disk usage within a file system
# cask "grandperspective"
# Open-source video transcoder
cask "handbrake-app"
# Testing client for REST, GraphQL, and HTTP APIs
cask "httpie-desktop"
# Chat client for models on HuggingFace
cask "huggingchat"
# Battery level monitoring software
# cask "ibettercharge"
# Free and open-source media player
# cask "iina"
# Tool to optimise images to a smaller size
cask "imageoptim"
# iPhone management application
cask "imazing"
# Utility to create bootable system install discs
# cask "install-disk-creator"
# Game client for itch.io
# cask "itch"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar manager
cask "jordanbaird-ice"
# Utility to render Jupyter notebooks
# cask "jupyter-notebook-viewer"
# Open-source screen recorder built with web technology
cask "kap"
# File archiver
cask "keka"
# End-to-end encryption software
# cask "keybase"
# GPU-based terminal emulator
cask "kitty"
# Automator software to start apps, run scripts or commands and more
# cask "lingon-x"
# Open-source Markdown editor
cask "macdown"
# Shows the next meeting in the menu bar
cask "meetingbar"
# Mp4 meta-data editor
cask "metaz"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Native app email client for Gmail
# cask "mimestream"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Silence embarrassing notifications while screensharing
cask "muzzle"
# Htop on steroids
cask "neohtop"
# Free and open-source RSS reader
# cask "netnewswire"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Calculator and converter application
cask "numi"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Get up and running with large language models locally
cask "ollama-app"
# Finds large, unwanted files and deletes them
cask "omnidisksweeper"
# Verify system files structure, run miscellaneous maintenance and more
# cask "onyx"
# Audiobook manager for Audible users
cask "openaudible"
# Monitors computer mic and webcam
cask "oversight"
# Extract files and folders from package files, disk images, and archives
# cask "pacifist"
# Tool to eliminate similar or duplicate photos
cask "photosweeper-x"
# Home media server
cask "plex-media-server"
# Podcast platform
cask "pocket-casts"
# G-code generator for 3D printers (RepRap, Makerbot, Ultimaker etc.)
cask "prusaslicer"
# IDE for professional Python development
# cask "pycharm"
# IDE for Python programming - Community Edition
# cask "pycharm-ce"
# Quick Look plug-in that renders source code with syntax highlighting
# cask "qlcolorcode"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin to view patch files
# cask "qlprettypatch"
# Quick Look plugin for plaintext files without an extension
# cask "qlstephen"
# Quick Look plugin for CSV files
# cask "quicklook-csv"
# Quick Look plugin for JSON files
# cask "quicklook-json"
# Automatically hides or quits apps after periods of inactivity
cask "quitter"
# All-in-one bookmark manager
cask "raindropio"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Save articles to read, highlight key content, and organise notes for review
cask "reader"
# Show installed app compatibility information
cask "roaringapps"
# Tool for sending personal documents to Kindles from Macs
cask "send-to-kindle"
# Instant messaging application focusing on security
cask "signal"
# Video chat, voice call and instant messaging application
# cask "skype"
# Team communication and collaboration software
cask "slack"
# cask "slimbatterymonitor"
# Code source explorer
# cask "sourcetrail"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
 # Command-line client for Steam
cask "steamcmd"
# Break time reminder app
# cask "stretchly"
# Mux and tag mp4 files
cask "subler"
# Backup, recovery and cloning software
# cask "superduper"
# Application for inspecting installer packages
cask "suspicious-package"
# Menu bar customization tool
# cask "swiftbar"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Unpacks archive files
# cask "the-unarchiver"
# End-to-end encrypted instant messaging application
cask "threema"
# Multi-platform VNC client and server
cask "tigervnc-viewer"
# Control your data usage on slow or expensive networks
cask "tripmode"
# 3D printer and slicing GUI
# cask "ultimaker-cura"
# Mutes your keyboard while you type
cask "unclack"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "webex"
# Quick Look plugin for webp files
# cask "webpquicklook"
# Agentic IDE powered by AI Flow paradigm
cask "windsurf"
# Network protocol analyzer
cask "wireshark-app"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Application for generating TOTP and HOTP codes
cask "yubico-authenticator"
# Application for configuring any YubiKey
# cask "yubico-yubikey-manager"

{{- if eq .chezmoi.arch "arm64" -}}{{/* darwin not .work not .lite arm64 */}}
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
{{ end }}{{/* darwin not .work not .lite arm64 */}}

{{- if not .test }}{{/* darwin not .work not .lite not .test */}}
# Clipboard manager
cask "clipy"
# Note-taking application that supports Markdown
cask "fsnotes"
# Git GUI client
cask "gitkraken"
# Markdown editor and viewer
cask "macdown"
# Markdown editor for Mac, Windows, and Linux
cask "typora"
# Menubar app to control music players like Spotify, Apple Music, and YouTube Music
# Open links in any browser
# cask "choosy"
# Remote file sharing for ChronoSync
# cask "chronoagent"
# Scientific and technical publishing system built on Pandoc
cask "quarto"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Apple Configurator", id: 1037126344
mas "Brother P-touch Editor", id: 1453365242
mas "Day One", id: 1055511498
# mas "Disk Diag", id: 672206759
mas "Display Menu", id: 549083868
# mas "Drafts", id: 1435957248
# mas "Due", id: 524373870
mas "Duplicate Cleaner For iPhoto", id: 586862299
mas "Duplicate Photos Fixer Pro", id: 963642514
mas "Enchanted", id: 6474268307
mas "Framous", id: 6636520519
mas "GarageBand", id: 682658836
mas "GIPHY CAPTURE", id: 668208984
mas "Hidden Bar", id: 1452453066
mas "Hyperspace", id: 6739505345
# mas "iMovie", id: 408981434
# mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
# mas "Lightweight PDF", id: 1450640351
mas "NextDNS", id: 1464122853
# mas "Numbers", id: 409203825
mas "One Thing", id: 1604176982
# mas "Pages", id: 409201541
# mas "Pocket", id: 568494494
mas "Public IP", id: 6449373983
mas "Recipe Keeper", id: 1315583175
mas "SafeHomeCamera", id: 1176788147
# mas "Save to Pocket", id: 1477385213
mas "Save to Raindrop.io", id: 1549370672
mas "Shush", id: 496437906
# mas "SimpleLogin", id: 1494051017
mas "Speedtest", id: 1153157709
mas "TestFlight", id: 899247664
# mas "UnPlugged", id: 423123087
mas "WhiteNoise", id: 415139197
mas "WiFi Explorer", id: 494803304
mas "Windows App", id: 1295203466
mas "WireGuard", id: 1451685025
mas "WordService", id: 899972312

{{ end }}{{/* darwin not .work not .lite not .test */}}
{{ end }}{{/* darwin not .work not .lite */}}
{{ else if .work }}{{/* darwin not .work */}}
brew "awscli"
brew "graphite"
# # Visual tool to design, develop and administer MySQL servers
# cask "mysqlworkbench"
{{ end }}{{/* darwin .work */}}
{{ else if eq .chezmoi.os "linux" }}{{/* darwin */}}
tap wezterm/wezterm-linuxbrew

brew "wezterm"

{{ end }}{{/* linux */}}
