tap 'caskroom/cask', 'git@github.com:caskroom/homebrew-cask'
tap 'docmunch/pdftk'
tap 'homebrew/bundle'
tap 'homebrew/command-not-found'
tap 'homebrew/completions'
tap 'homebrew/dupes'
tap 'homebrew/emacs'
tap 'homebrew/fuse'
tap 'homebrew/science'
tap 'homebrew/versions'
tap 'homebrew/homebrew-x11'
brew 'ack'
brew 'advancecomp'
brew 'ant'
brew 'apg'
brew 'archey'
brew 'aspell'
brew 'autoconf'
brew 'autojump'
brew 'automake'
brew 'bash'
brew 'binutils'
brew 'c-ares'
brew 'cairo'
brew 'cask'
brew 'cheat'
brew 'checkstyle'
brew 'cloog'
brew 'cmake'
brew 'colordiff'
brew 'cookiecutter'
brew 'coreutils'
brew 'cowsay'
brew 'cscope'
brew 'curl', args: ['with-ssl', 'with-libssh2']
brew 'd-bus'
brew 'daq'
brew 'docmunch/pdftk/pdftk'
brew 'dos2unix'
brew 'ecj'
brew 'editorconfig'
brew 'emacs'
brew 'epstool'
brew 'faac'
brew 'ffmpeg'
brew 'fftw'
brew 'figlet'
brew 'findutils', args: ['default-names']
brew 'fontconfig'
brew 'fortune'
brew 'freetype'
brew 'gawk'
brew 'gcc', args: ['with-all-languages']
brew 'gd'
brew 'gdb'
brew 'gdbm'
brew 'geoip'
brew 'gettext'
brew 'ghostscript'
brew 'git', args: ['with-brewed-curl', 'with-brewed-openssl', 'with-brewed-svn', 'with-gettext', 'with-pcre', 'with-persistent-https']
brew 'git-ftp'
brew 'gl2ps'
brew 'glib'
brew 'gmp'
brew 'gpg-agent'
brew 'gnu-indent', args: ['default-names']
brew 'gnu-sed', args: ['default-names']
brew 'gnu-tar', args: ['default-names']
brew 'gnu-which', args: ['with-default-names']
brew 'gnuplot', args: ['with-qt', 'with-x11']
brew 'gnutls'
brew 'go'
brew 'gobject-introspection'
brew 'graphicsmagick'
brew 'gwt'
brew 'homebrew/completions/bash-completion'
brew 'homebrew/completions/brew-cask-completion'
brew 'homebrew/completions/bundler-completion'
brew 'homebrew/completions/docker-completion'
brew 'homebrew/completions/docker-machine-completion'
brew 'homebrew/completions/gem-completion'
brew 'homebrew/completions/maven-completion'
brew 'homebrew/completions/open-completion'
brew 'homebrew/completions/pip-completion'
brew 'homebrew/completions/ruby-completion'
brew 'homebrew/completions/sonar-completion'
brew 'homebrew/completions/tmuxinator-completion'
brew 'homebrew/completions/vagrant-completion'
brew 'homebrew/dupes/diffutils'
brew 'homebrew/dupes/ed', args: ['with-default-names']
brew 'homebrew/dupes/file-formula'
brew 'homebrew/dupes/gpatch'
brew 'homebrew/dupes/grep', args: ['with-default-names']
brew 'homebrew/dupes/gzip'
brew 'homebrew/dupes/less'
brew 'homebrew/dupes/lsof'
brew 'homebrew/dupes/m4'
brew 'homebrew/dupes/make'
brew 'homebrew/dupes/nano'
brew 'homebrew/dupes/ncurses'
brew 'homebrew/dupes/openssh'
brew 'homebrew/dupes/rsync'
brew 'homebrew/dupes/screen'
brew 'homebrew/dupes/tcpdump'
brew 'homebrew/dupes/units'
brew 'homebrew/dupes/unzip'
brew 'homebrew/emacs/dash-emacs'
brew 'homebrew/emacs/git-messenger'
brew 'homebrew/emacs/git-modes'
brew 'homebrew/emacs/homebrew-mode'
brew 'homebrew/emacs/hydra-emacs'
brew 'homebrew/emacs/inf-ruby'
brew 'homebrew/emacs/json-mode'
brew 'homebrew/emacs/json-reformat'
brew 'homebrew/emacs/json-snatcher'
brew 'homebrew/emacs/markdown-mode'
brew 'homebrew/emacs/org-mode'
brew 'homebrew/emacs/pandoc-mode'
brew 'homebrew/emacs/popup'
brew 'homebrew/emacs/yaml-mode'
brew 'homebrew/fuse/ntfs-3g'
brew 'homebrew/fuse/sshfs'
brew 'homebrew/science/arpack'
brew 'homebrew/science/glpk'
brew 'homebrew/science/hdf5'
brew 'homebrew/science/octave'
brew 'homebrew/science/qhull'
brew 'homebrew/science/qrupdate'
brew 'homebrew/science/r'
brew 'homebrew/science/suite-sparse'
brew 'homebrew/science/suite-sparse421'
brew 'homebrew/science/veclibfort'
brew 'homebrew/versions/perl518'
brew 'homebrew/homebrew-x11/gv'
brew 'httpie'
brew 'hub'
brew 'hunspell'
brew 'icdiff'
brew 'icu4c'
brew 'imagemagick'
brew 'isl'
brew 'gifsicle'
brew 'jbig2dec'
brew 'jhead'
brew 'jpeg'
brew 'jpegoptim'
brew 'keychain'
brew 'lame'
brew 'lastpass-cli', args: ['with-doc']
brew 'libdnet'
brew 'libdvdcss'
brew 'libffi'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libmpc'
brew 'libpng'
brew 'libsodium'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'libvo-aacenc'
brew 'libyaml'
brew 'little-cms2'
brew 'lua'
brew 'luajit'
brew 'lynx'
brew 'lzip'
brew 'mackup'
brew 'macvim', args: ['with-override-system-vim']
brew 'makedepend'
brew 'maven'
brew 'mercurial'
brew 'mkdocs'
brew 'mongodb', args: ['with-openssl']
brew 'mpfr'
brew 'mysql-connector-c'
brew 'nettle'
brew 'nmap'
brew 'node'
brew 'openjpeg'
brew 'openssl'
brew 'optipng'
brew 'pandoc'
brew 'pandoc-citeproc'
brew 'pcre'
brew 'pixman'
brew 'pkg-config'
brew 'plotutils'
brew 'pngcrush'
brew 'pngquant'
brew 'poppler'
brew 'pstoedit'
brew 'pv'
brew 'pwgen'
brew 'pyqt'
brew 'python'
brew 'qscintilla2'
brew 'qt'
brew 'rbenv'
brew 'readline'
brew 'rename'
brew 'ruby-build'
brew 'screenfetch'
brew 'shellcheck'
brew 'sip'
brew 'snort'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'subversion'
brew 'szip'
brew 'tbb'
brew 'tesseract'
brew 'texi2html'
brew 'texinfo'
brew 'thefuck'
brew 'the_silver_searcher'
brew 'tivodecode'
brew 'tmux'
brew 'tomcat'
brew 'trash'
brew 'tree'
brew 'vim', args: ['override-system-vi']
brew 'watch'
brew 'wdiff', args: ['with-gettext']
brew 'webkit2png'
brew 'wget'
brew 'wireshark'
brew 'x264'
brew 'xvid'
brew 'xz'
brew 'yasm'
brew 'youtube-dl'
brew 'zopfli'
brew 'zsh'
cask '1password', args: { appdir: '/Applications' }
cask 'adobe-reader', args: { appdir: '/Applications' }
cask 'amazon-cloud-drive', args: { appdir: '/Applications' }
cask 'appcleaner', args: { appdir: '/Applications' }
cask 'appfresh', args: { appdir: '/Applications' }
cask 'apptrap', args: { appdir: '/Applications' }
cask 'aquamacs', args: { appdir: '/Applications' }
cask 'backblaze', args: { appdir: '/Applications' }
cask 'bartender', args: { appdir: '/Applications' }
cask 'bettertouchtool', args: { appdir: '/Applications' }
cask 'betterzip', args: { appdir: '/Applications' }
cask 'betterzipql', args: { appdir: '/Applications' }
cask 'bibdesk', args: { appdir: '/Applications' }
cask 'bittorrent-sync', args: { appdir: '/Applications' }
cask 'box-sync', args: { appdir: '/Applications' }
cask 'caffeine', args: { appdir: '/Applications' }
cask 'cakebrew', args: { appdir: '/Applications' }
cask 'carbon-copy-cloner', args: { appdir: '/Applications' }
cask 'carmaintenance', args: { appdir: '/Applications' }
cask 'cheatsheet', args: { appdir: '/Applications' }
cask 'choosy', args: { appdir: '/Applications' }
cask 'chrome-remote-desktop-host', args: { appdir: '/Applications' }
cask 'chromium', args: { appdir: '/Applications' }
cask 'clamxav', args: { appdir: '/Applications' }
cask 'controlplane', args: { appdir: '/Applications' }
cask 'cord', args: { appdir: '/Applications' }
cask 'crashplan', args: { appdir: '/Applications' }
cask 'ctivo', args: { appdir: '/Applications' }
cask 'dash', args: { appdir: '/Applications' }
cask 'disk-inventory-x', args: { appdir: '/Applications' }
cask 'diskmaker-x', args: { appdir: '/Applications' }
cask 'diskwave', args: { appdir: '/Applications' }
cask 'dnscrypt', args: { appdir: '/Applications' }
cask 'dockertoolbox', args: { appdir: '/Applications' }
cask 'dropbox', args: { appdir: '/Applications' }
cask 'duplicate-annihilator', args: { appdir: '/Applications' }
cask 'eclipse-java', args: { appdir: '/Applications' }
cask 'emacs', args: { appdir: '/Applications' }
cask 'evernote', args: { appdir: '/Applications' }
cask 'filezilla', args: { appdir: '/Applications' }
cask 'firefox', args: { appdir: '/Applications' }
cask 'fitbit-connect', args: { appdir: '/Applications' }
cask 'flash', args: { appdir: '/Applications' }
cask 'flashlight', args: { appdir: '/Applications' }
cask 'flickr-uploadr', args: { appdir: '/Applications' }
cask 'flux', args: { appdir: '/Applications' }
cask 'ganttproject', args: { appdir: '/Applications' }
cask 'geektool', args: { appdir: '/Applications' }
cask 'gephi', args: { appdir: '/Applications' }
cask 'gimp', args: { appdir: '/Applications' }
cask 'github-desktop', args: { appdir: '/Applications' }
cask 'goodsync', args: { appdir: '/Applications' }
cask 'google-chrome', args: { appdir: '/Applications' }
cask 'google-drive', args: { appdir: '/Applications' }
cask 'google-photos-backup', args: { appdir: '/Applications' }
cask 'gpgtools', args: { appdir: '/Applications' }
cask 'grandperspective', args: { appdir: '/Applications' }
cask 'growl-fork', args: { appdir: '/Applications' }
cask 'growlnotify', args: { appdir: '/Applications' }
cask 'growlvoice', args: { appdir: '/Applications' }
cask 'handbrake', args: { appdir: '/Applications' }
cask 'handylock', args: { appdir: '/Applications' }
cask 'ibettercharge', args: { appdir: '/Applications' }
cask 'imageoptim', args: { appdir: '/Applications' }
cask 'iterm2', args: { appdir: '/Applications' }
cask 'java'
cask 'karabiner', args: { appdir: '/Applications' }
cask 'keka', args: { appdir: '/Applications' }
cask 'kindle', args: { appdir: '/Applications' }
cask 'lastpass', args: { appdir: '/Applications' }
cask 'libreoffice', args: { appdir: '/Applications' }
cask 'logitech-control-center', args: { appdir: '/Applications' }
cask 'logitech-myharmony', args: { appdir: '/Applications' }
cask 'logitech-unifying', args: { appdir: '/Applications' }
cask 'lyx', args: { appdir: '/Applications' }
cask 'macdown', args: { appdir: '/Applications' }
cask 'macfusion', args: { appdir: '/Application' }
cask 'mactex', args: { appdir: '/Applications' }
cask 'macx-youtube-downloader', args: { appdir: '/Applications' }
cask 'mailbox', args: { appdir: '/Applications' }
cask 'makemkv', args: { appdir: '/Applications' }
cask 'malwarebytes-anti-malware', args: { appdir: '/Applications' }
cask 'marked', args: { appdir: '/Applications' }
cask 'mendeley-desktop', args: { appdir: '/Applications' }
cask 'metaz', args: { appdir: '/Applications' }
cask 'microsoft-office', args: { appdir: '/Applications' }
cask 'mysqlworkbench', args: { appdir: '/Applications' }
cask 'no-ip-duc', args: { appdir: '/Applications' }
cask 'notebook', args: { appdir: '/Applications' }
cask 'omnidisksweeper', args: { appdir: '/Applications' }
cask 'omnifocus', args: { appdir: '/Applications' }
cask 'onyx', args: { appdir: '/Applications' }
cask 'osxfuse', args: { appdir: '/Applications' }
cask 'pacifist', args: { appdir: '/Applications' }
cask 'picasa', args: { appdir: '/Applications' }
cask 'prey', args: { appdir: '/Applications' }
cask 'pycharm', args: { appdir: '/Applications' }
cask 'pycharm-ce', args: { appdir: '/Applications' }
cask 'qlcolorcode', args: { appdir: '/Applications' }
cask 'qlmarkdown', args: { appdir: '/Applications' }
cask 'qlprettypatch', args: { appdir: '/Applications' }
cask 'qlstephen', args: { appdir: '/Applications' }
cask 'quicklook-csv', args: { appdir: '/Applications' }
cask 'quicklook-json', args: { appdir: '/Applications' }
cask 'quicksilver', args: { appdir: '/Applications' }
cask 'remote-desktop-connection', args: { appdir: '/Applications' }
cask 'rstudio', args: { appdir: '/Applications' }
cask 'send-to-kindle', args: { appdir: '/Applications' }
cask 'sequel-pro', args: { appdir: '/Applications' }
cask 'shazzlemailclient', args: { appdir: '/Applications' }
cask 'sshfs', args: { appdir: '/Applications' }
cask 'silverlight', args: { appdir: '/Applications' }
cask 'skyfonts', args: { appdir: '/Applications' }
cask 'skype', args: { appdir: '/Applications' }
cask 'slack', args: { appdir: '/Applications' }
cask 'slimbatterymonitor', args: { appdir: '/Applications' }
cask 'sookasa', args: { appdir: '/Applications' }
cask 'sourcetree', args: { appdir: '/Applications' }
cask 'spectacle', args: { appdir: '/Applications' }
cask 'spotdox', args: { appdir: '/Applications' }
cask 'steam', args: { appdir: '/Applications' }
cask 'sublime-text', args: { appdir: '/Applications' }
cask 'suspicious-package', args: { appdir: '/Applications' }
cask 'teamviewer', args: { appdir: '/Applications' }
cask 'tether', args: { appdir: '/Applications' }
cask 'texshop', args: { appdir: '/Applications' }
cask 'texstudio', args: { appdir: '/Applications' }
cask 'textwrangler', args: { appdir: '/Applications' }
cask 'the-unarchiver', args: { appdir: '/Applications' }
cask 'thunderbird', args: { appdir: '/Applications' }
cask 'tower', args: { appdir: '/Applications' }
cask 'transmission', args: { appdir: '/Applications' }
cask 'transmit', args: { appdir: '/Applications' }
cask 'tresorit', args: { appdir: '/Applications' }
cask 'unison', args: { appdir: '/Applications' }
cask 'virtualbox', args: { appdir: '/Applications' }
cask 'vlc', args: { appdir: '/Applications' }
cask 'webpquicklook', args: { appdir: '/Applications' }
cask 'wireshark', args: { appdir: '/Applications' }
cask 'xquartz', args: { appdir: '/Applications' }
cask 'zotero', args: { appdir: '/Applications' }
