tap 'alexdavid/homebrew-tap'
tap 'caskroom/cask', 'git@github.com:caskroom/homebrew-cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/command-not-found'
tap 'homebrew/services'

cask 'java'
cask 'osxfuse'
cask 'xquartz'

brew 'openssl'
brew 'openssh', args: ['with-brewed-openssl', 'with-keychain-support']
brew 'curl', args: ['with-ssl', 'with-libssh2']
brew 'svn'
brew 'parallel'  # Install before moreutils that also different `parallel` command.

brew 'ack'
brew 'advancecomp'
brew 'ag'
brew 'ant'
brew 'antiword'
brew 'apache-spark'
brew 'apg'
brew 'archey'
brew 'arpack'
brew 'aspell'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'aws-shell'
brew 'bash'
brew 'bash-completion'
brew 'binutils'
brew 'brew-cask-completion'
brew 'bundler-completion'
brew 'c-ares'
brew 'cairo'
brew 'cask'
brew 'ccache'
brew 'certbot'
brew 'cheat'
brew 'checkstyle'
brew 'cloog'
brew 'cmake'
brew 'colordiff'
brew 'cookiecutter'
brew 'coreutils' #, args: ['default-names']
brew 'cowsay'
brew 'cscope'
brew 'd-bus'
brew 'daq'
brew 'diffutils'
brew 'direnv'
brew 'docker-clean'
brew 'docker-completion'
brew 'docker-compose-completion'
brew 'docker-machine-completion'
brew 'docmunch/pdftk/pdftk'
brew 'dos2unix'
brew 'ecj'
brew 'ed'#, args: ['with-default-names']
brew 'editorconfig'
brew 'emacs', args: ['with-imagemagick', 'with-modules']
brew 'epstool'
brew 'faac'
brew 'fasd'
brew 'ffmpeg'
brew 'fftw'
brew 'figlet'
brew 'file-formula'
brew 'findutils' #, args: ['default-names']
brew 'flake8'
brew 'fontconfig'
brew 'fortune'
brew 'freetype'
brew 'fzf'
brew 'gawk'
brew 'gbeine/homebrew-java/postgresql-jdbc'
brew 'gcc', args: ['with-jit', 'with-nls']
brew 'gd'
brew 'gdb'
brew 'gdbm'
brew 'gem-completion'
brew 'geoip'
brew 'gettext'
brew 'ghostscript'
brew 'gifsicle'
brew 'git', args: ['with-brewed-curl', 'with-brewed-openssl', 'with-brewed-svn', 'with-gettext', 'with-pcre', 'with-persistent-https']
brew 'git-branch-status'
brew 'git-ftp'
brew 'git-lfs'
brew 'git-standup'
brew 'gl2ps'
brew 'glib'
brew 'glpk'
brew 'gmp'
brew 'gnu-getopt'
brew 'gnu-indent' #, args: ['default-names']
brew 'gnu-sed' #, args: ['default-names']
brew 'gnu-tar' #, args: ['default-names']
brew 'gnu-which' #, args: ['with-default-names']
brew 'gnuplot', args: ['with-qt', 'with-x11']
brew 'gnutls'
brew 'go'
brew 'gobject-introspection'
brew 'gpatch'
brew 'gpg-agent'
brew 'graphicsmagick'
brew 'graphviz'
brew 'grep'#, args: ['with-default-names']
brew 'gwt'
brew 'gzip'
brew 'hadolint'
brew 'hadoop'
brew 'hdf5'
brew 'homebrew/emacs/dash-emacs'
brew 'homebrew/emacs/git-messenger'
brew 'homebrew/emacs/git-modes'
brew 'homebrew/emacs/homebrew-mode'
brew 'homebrew/emacs/hydra-emacs'
brew 'homebrew/emacs/inf-ruby'
brew 'homebrew/emacs/json-mode'
brew 'homebrew/emacs/json-reformat'
brew 'homebrew/emacs/json-snatcher'
brew 'homebrew/emacs/markdown-mode'
brew 'homebrew/emacs/org-mode'
brew 'homebrew/emacs/pandoc-mode'
brew 'homebrew/emacs/popup'
brew 'homebrew/emacs/solarized-emacs'
brew 'homebrew/emacs/yaml-mode'
brew 'homebrew/fuse/ntfs-3g'
brew 'homebrew/fuse/sshfs'
brew 'homebrew/gui/gsmartcontrol'
brew 'homebrew/homebrew-x11/gv'
brew 'homebrew/science/r'
brew 'homebrew/science/suite-sparse421'
brew 'homebrew/versions/perl518'
brew 'homesick-completion'
brew 'httpie'
brew 'hub'
brew 'hunspell'
brew 'icdiff'
brew 'icu4c'
brew 'imagemagick'
brew 'isl'
brew 'jbig2dec'
brew 'jenv'
brew 'jhead'
brew 'jonof/kenutils/pngout'
brew 'jpeg'
brew 'jpegoptim'
brew 'jq'
brew 'jsonlint'
brew 'keychain'
brew 'lame'
brew 'launchctl-completion'
brew 'less'
brew 'libdnet'
brew 'libdvdcss'
brew 'libffi'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libmpc'
brew 'libpng'
brew 'libsodium'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'libvo-aacenc'
brew 'libyaml'
brew 'little-cms2'
brew 'lsof'
brew 'lua'
brew 'luajit'
brew 'lynx'
brew 'lzip'
brew 'm4'
brew 'mackup'
brew 'macvim'  #, args: ['with-override-system-vim']
brew 'make'
brew 'makedepend'
brew 'mas'
brew 'mkdocs'
brew 'mongodb', args: ['with-openssl']
brew 'moreutils'
brew 'mpfr'
brew 'mysql-connector-c'
brew 'nano'
brew 'nettle'
brew 'nmap'
brew 'node'
brew 'octave', args: ['with-gui']
brew 'open-completion'
brew 'openjpeg'
brew 'optipng'
brew 'pandoc'
brew 'pandoc-citeproc'
brew 'pcre'
# brew 'pinentry-mac' # Use GPG Suite instead.
brew 'pipenv'
brew 'pip-completion'
brew 'pixman'
brew 'pkg-config'
brew 'plotutils'
brew 'pngcrush'
brew 'pngquant'
brew 'poppler'
brew 'postgresql'
brew 'pstoedit'
brew 'pv'
brew 'pwgen'
brew 'pycodestyle'
brew 'pyenv'
brew 'pyenv-ccache'
brew 'pyenv-pip-migrate'
brew 'pyenv-virtualenv'
brew 'pyenv-which-ext'
brew 'pyqt'
brew 'python'
brew 'qhull'
brew 'qrupdate'
brew 'qscintilla2'
brew 'qt'
brew 'rbenv'
brew 'readline'
brew 'rename'
brew 'restview'
brew 'rst-lint'
brew 'rsync'
brew 'ruby-build'
brew 'ruby-completion'
brew 'scala'
brew 'screen'
brew 'screenfetch'
brew 'shellcheck'
brew 'sip'
brew 'snort'
brew 'sonar-completion'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'stormssh-completion'
brew 'subversion'
brew 'suite-sparse'
brew 'szip'
brew 'tbb'
brew 'tcpdump'
brew 'tesseract'
brew 'texi2html'
brew 'texinfo'
brew 'thefuck'
brew 'the_silver_searcher'
brew 'tig'
brew 'tivodecode'
brew 'tmux'
brew 'tmuxinator-completion'
brew 'tomcat'
brew 'trash'
brew 'tree'
brew 'units'
brew 'unzip'
brew 'vagrant-completion'
brew 'veclibfort'
brew 'vim'  # , args: ['override-system-vi']
brew 'vitorgalvao/tiny-scripts/cask-repair'
brew 'watch'
brew 'wdiff', args: ['with-gettext']
brew 'webkit2png'
brew 'wget'
brew 'wine'
brew 'winetricks'
brew 'wireshark'
brew 'x264'
brew 'xvid'
brew 'xz'
brew 'yasm'
brew 'youtube-dl'
brew 'zopfli'
brew 'zsh'

cask '1password' #, args: { appdir: '/Applications' }
cask 'adobe-reader'
cask 'appfresh'
cask 'apptrap'
cask 'aquamacs'
cask 'avast-security'
cask 'backblaze'
cask 'bartender'
cask 'bbedit'
cask 'bettertouchtool'
cask 'betterzip'
cask 'box-sync'
cask 'cakebrew'
cask 'carbon-copy-cloner'
cask 'carmaintenance'
cask 'cheatsheet'
cask 'choosy'
cask 'chrome-remote-desktop-host'
cask 'chromium'
cask 'coconutBattery'
cask 'controlplane'
cask 'cord'
cask 'ctivo'
cask 'dash'
cask 'dbeaver-enterprise'
cask 'dbvisualizer'
cask 'diskmaker-x'
cask 'diskwave'
cask 'dnscrypt'
cask 'docker'
cask 'docker-toolbox'
cask 'dockertoolbox'
cask 'dropbox'
cask 'duplicate-annihilator'
cask 'emacs'
cask 'evernote'
cask 'filebot'
cask 'filezilla'
cask 'firefox'
cask 'fitbit-connect'
cask 'flashlight'
cask 'flickr-uploadr'
cask 'flux'
cask 'ganttproject'
cask 'geektool'
cask 'gephi'
cask 'gimp'
cask 'goodsync'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'google-photos-backup'
cask 'gpg-suite'
cask 'grammarly'
cask 'grandperspective'
cask 'growlnotify'
cask 'growlvoice'
cask 'handbrake'
cask 'handylock'
cask 'ibettercharge'
cask 'imageoptim'
cask 'iterm2'
cask 'java8'
cask 'jing'
cask 'joinme'
cask 'karabiner'
cask 'keka'
cask 'keybase'
cask 'kindle'
cask 'kite'
cask 'lastpass'
cask 'libdvdcss'
cask 'libreoffice'
cask 'logitech-control-center'
cask 'logitech-myharmony'
cask 'logitech-unifying'
cask 'lyx'
cask 'macdown'
cask 'macfusion'
cask 'macfusion', args: { appdir: '/Application' }
cask 'mactex'
cask 'macx-youtube-downloader'
cask 'mailbox'
cask 'makemkv'
cask 'malwarebytes-anti-malware'
cask 'marked'
cask 'mendeley-desktop'
cask 'metaz'
cask 'microsoft-office'
cask 'mysqlworkbench'
cask 'no-ip-duc'
cask 'notebook'
cask 'omnidisksweeper'
cask 'omnifocus'
cask 'onyx'
cask 'oversight'
cask 'p4merge'
cask 'pacifist'
cask 'podcastmenu'
cask 'prey'
cask 'pycharm'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlrest'  # Needs python dependencies installed in system python - https://github.com/cluther/qlrest.
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'send-to-kindle'
cask 'sequel-pro'
cask 'shazzlemailclient'
cask 'silverlight'
cask 'skyfonts'
cask 'skype'
cask 'slack'
cask 'slimbatterymonitor'
cask 'snowflake-snowsql'
cask 'sookasa'
cask 'sourcetree'
cask 'spectacle'
cask 'spotdox'
cask 'sshfs'
cask 'steam'
cask 'subler'
cask 'sublime-text'
cask 'suspicious-package'
cask 'texshop'
cask 'texstudio'
cask 'the-unarchiver'
cask 'thunderbird'
cask 'tonido'
cask 'tonidosync'
cask 'transmission'
cask 'transmit'
cask 'tresorit'
cask 'tunnelblick'
cask 'unison'
cask 'virtualbox'
cask 'vlc'
cask 'webpquicklook'
cask 'wireshark'
cask 'yujitach-menumeters'
cask 'zotero'


mas 1055511498 # Day One
mas 408981381 # iPhoto
mas 408981434 # iMovie
mas 409183694 # Keynote
mas 409201541 # Pages
mas 409203825 # Numbers
mas 409789998 # Twitter
mas 415139197 # WhiteNoise
mas 423123087 # UnPlugged
mas 424470626 # SSH Tunnel Manager
mas 439845554 # Reeder
mas 451444120 # Memory Clean
mas 467939042 # Growl
mas 485812721 # TweetDeck
mas 494803304 # WiFi Explorer
mas 497799835 # Xcode
mas 509148961 # SMARTReporter
mas 523620159 # CleanMyDrive 2
mas 533491939 # Mint QuickView
mas 568494494 # Pocket
mas 586862299 # Duplicate Cleaner For iPhoto
mas 642220194 # DeskConnect
mas 672206759 # Disk Diag
mas 715768417 # Microsoft Remote Desktop
mas 784801555 # Microsoft OneNote
mas 823766827 # OneDrive
mas 937984704 Amphetamine
