tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'docmunch/pdftk'
tap 'homebrew/boneyard'
tap 'homebrew/bundle'
tap 'homebrew/command-not-found'
tap 'homebrew/completions'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/emacs'
tap 'homebrew/fuse'
tap 'homebrew/python'
tap 'homebrew/science'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'homebrew/x11'
tap 'jonof/kenutils'
cask 'mactex'
cask 'osxfuse'
cask 'xquartz'
brew 'ack'
brew 'ant'
brew 'archey'
brew 'aspell'
brew 'autoconf'
brew 'automake'
brew 'libtool'
brew 'atomicparsley'
brew 'autojump'
brew 'readline'
brew 'bash'
brew 'bash-completion'
brew 'binutils'
brew 'c-ares'
brew 'libpng'
brew 'freetype'
brew 'pkg-config'
brew 'fontconfig'
brew 'gettext'
brew 'libffi'
brew 'pcre'
brew 'glib'
brew 'pixman'
brew 'cairo'
brew 'dbus'
brew 'gmp'
brew 'libtasn1'
brew 'nettle'
brew 'gnutls'
brew 'isl'
brew 'mpfr'
brew 'libmpc'
brew 'gcc', args: ['with-all-languages']
brew 'fftw'
brew 'jpeg'
brew 'xz'
brew 'libtiff'
brew 'little-cms2'
brew 'ghostscript'
brew 'git'
brew 'gobject-introspection'
brew 'shared-mime-info'
brew 'gdk-pixbuf'
brew 'libcroco'
brew 'icu4c'
brew 'harfbuzz'
brew 'pango'
brew 'librsvg'
brew 'cmake'
brew 'openjpeg'
brew 'perl'
brew 'webp'
brew 'imagemagick'
brew 'emacs', restart_service: true
brew 'cask'
brew 'cheat'
brew 'cloog'
brew 'colordiff'
brew 'coreutils'
brew 'cowsay'
brew 'cscope'
brew 'makedepend'
brew 'openssl'
brew 'libssh2'
brew 'curl', args: ['with-libssh2']
brew 'daq'
brew 'go'
brew 'direnv'
brew 'libgpg-error'
brew 'libassuan'
brew 'libgcrypt'
brew 'libksba'
brew 'pth'
brew 'dirmngr'
brew 'docx2txt'
brew 'dos2unix'
brew 'ecj'
brew 'epstool'
brew 'faac'
brew 'fasd'
brew 'lame'
brew 'texi2html'
brew 'gdbm'
brew 'sqlite'
brew 'python'
brew 'yasm'
brew 'x264'
brew 'xvid'
brew 'ffmpeg'
brew 'findutils', args: ['with-default-names']
brew 'fltk'
brew 'fortune'
brew 'fzf'
brew 'gawk'
brew 'gd'
brew 'gdb'
brew 'geoip'
brew 'gl2ps'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'pinentry'
brew 'gpg-agent'
brew 'libusb'
brew 'libusb-compat'
brew 'gnupg2'
brew 'lua'
brew 'qt5'
brew 'gnuplot', args: ['with-qt5']
brew 'graphicsmagick'
brew 'gwt'
brew 'python3'
brew 'httpie'
brew 'hub'
brew 'hunspell'
brew 'icdiff'
brew 'jbig2dec'
brew 'jenv'
brew 'keychain'
brew 'libdnet'
brew 'libdvdcss'
brew 'libmagic'
brew 'libsodium'
brew 'libvo-aacenc'
brew 'libxml2'
brew 'libxslt'
brew 'libyaml'
brew 'luajit'
brew 'lzip'
brew 'mackup'
brew 'macvim', args: ['with-override-system-vim']
brew 'mas'
brew 'maven'
brew 'mercurial'
brew 'mongodb'
brew 'moreutils'
brew 'mysql-connector-c'
brew 'nmap'
brew 'node'
brew 'optipng'
brew 'pandoc'
brew 'pandoc-citeproc'
brew 'plotutils'
brew 'poppler'
brew 'pstoedit'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'sip', args: ['with-python3']
brew 'pyqt5'
brew 'qscintilla2'
brew 'qt'
brew 'ruby-build'
brew 'rbenv'
brew 'rename'
brew 'shellcheck'
brew 'snort'
brew 'ssh-copy-id'
brew 'subversion'
brew 'szip'
brew 'tbb'
brew 'texinfo'
brew 'the_silver_searcher'
brew 'thefuck'
brew 'tivodecode'
brew 'tomcat'
brew 'trash'
brew 'tree'
brew 'vim'
brew 'watch'
brew 'wdiff', args: ['with-gettext']
brew 'webkit2png'
brew 'wget'
brew 'wireshark'
brew 'youtube-dl'
brew 'zopfli'
brew 'zsh'
brew 'homebrew/boneyard/pyqt'
brew 'homebrew/completions/gem-completion'
brew 'homebrew/completions/maven-completion'
brew 'homebrew/completions/open-completion'
brew 'homebrew/completions/pip-completion'
brew 'homebrew/completions/ruby-completion'
brew 'homebrew/dupes/diffutils'
brew 'homebrew/dupes/ed', args: ['with-default-names']
brew 'homebrew/dupes/file-formula'
brew 'homebrew/dupes/gpatch'
brew 'homebrew/dupes/grep'
brew 'homebrew/dupes/gzip'
brew 'homebrew/dupes/less'
brew 'homebrew/dupes/lsof'
brew 'homebrew/dupes/m4'
brew 'homebrew/dupes/make'
brew 'homebrew/dupes/ncurses'
brew 'homebrew/dupes/nano'
brew 'homebrew/dupes/openssh'
brew 'homebrew/dupes/rsync'
brew 'homebrew/dupes/screen'
brew 'homebrew/dupes/tcpdump'
brew 'homebrew/dupes/units'
brew 'homebrew/dupes/unzip'
brew 'homebrew/emacs/cl-lib'
brew 'homebrew/emacs/dash-emacs'
brew 'homebrew/emacs/popup'
brew 'homebrew/emacs/git-messenger'
brew 'homebrew/emacs/git-modes'
brew 'homebrew/emacs/inf-ruby'
brew 'homebrew/emacs/homebrew-mode'
brew 'homebrew/emacs/hydra-emacs'
brew 'homebrew/emacs/json-reformat'
brew 'homebrew/emacs/json-snatcher'
brew 'homebrew/emacs/json-mode'
brew 'homebrew/emacs/markdown-mode'
brew 'homebrew/emacs/org-mode'
brew 'homebrew/emacs/pandoc-mode'
brew 'homebrew/emacs/yaml-mode'
brew 'homebrew/fuse/ntfs-3g'
brew 'homebrew/fuse/sshfs'
brew 'homebrew/science/veclibfort'
brew 'homebrew/science/arpack'
brew 'homebrew/science/glpk'
brew 'homebrew/science/hdf5'
brew 'homebrew/science/metis'
brew 'homebrew/science/qhull'
brew 'homebrew/science/qrupdate'
brew 'homebrew/science/suite-sparse'
brew 'homebrew/x11/imake'
brew 'homebrew/science/transfig'
brew 'homebrew/science/octave'
brew 'homebrew/science/r'
brew 'homebrew/versions/perl518'
brew 'homebrew/x11/xclip'
brew 'jonof/kenutils/pngout'
cask '1password'
cask 'adobe-reader'
cask 'amazon-cloud-drive'
cask 'amazon-drive'
cask 'appcleaner'
cask 'appfresh'
cask 'apptrap'
cask 'aquamacs'
cask 'backblaze'
cask 'bartender'
cask 'bettertouchtool'
cask 'betterzip'
cask 'betterzipql'
cask 'bibdesk'
cask 'bittorrent-sync'
cask 'bluestacks'
cask 'box-sync'
cask 'caffeine'
cask 'cakebrew'
cask 'carbon-copy-cloner'
cask 'carmaintenance'
cask 'cheatsheet'
cask 'choosy'
cask 'chrome-remote-desktop-host'
cask 'chromium'
cask 'clamxav'
cask 'controlplane'
cask 'cord'
cask 'crashplan'
cask 'ctivo'
cask 'disk-inventory-x'
cask 'diskmaker-x'
cask 'diskwave'
cask 'dnscrypt'
cask 'dockertoolbox'
cask 'dropbox'
cask 'duplicate-annihilator'
cask 'eclipse-java'
cask 'emacs'
cask 'evernote'
cask 'eye-fi'
cask 'filebot'
cask 'filezilla'
cask 'firefox'
cask 'fitbit-connect'
cask 'flash'
cask 'flashlight'
cask 'flickr-uploadr'
cask 'flux'
cask 'ganttproject'
cask 'geektool'
cask 'gephi'
cask 'gimp'
cask 'github-desktop'
cask 'goodsync'
cask 'google-chrome'
cask 'google-drive'
cask 'google-photos-backup'
cask 'gpgtools'
cask 'grandperspective'
cask 'growl-fork'
cask 'growlnotify'
cask 'growlvoice'
cask 'handbrake'
cask 'handylock'
cask 'ibettercharge'
cask 'imageoptim'
cask 'iterm2'
cask 'jettison'
cask 'karabiner'
cask 'keka'
cask 'kindle'
cask 'lastpass'
cask 'libreoffice'
cask 'logitech-control-center'
cask 'logitech-myharmony'
cask 'logitech-unifying'
cask 'lyx'
cask 'macdown'
cask 'macx-youtube-downloader'
cask 'makemkv'
cask 'malwarebytes-anti-malware'
cask 'marked'
cask 'mendeley-desktop'
cask 'metaz'
cask 'microsoft-office'
cask 'near-lock'
cask 'no-ip-duc'
cask 'omnidisksweeper'
cask 'omnifocus'
cask 'onyx'
cask 'pacifist'
cask 'picasa'
cask 'plex-media-server'
cask 'pycharm'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'quicksilver'
cask 'remote-desktop-connection'
cask 'rstudio'
cask 'send-to-kindle'
cask 'silverlight'
cask 'skyfonts'
cask 'skype'
cask 'slack'
cask 'slimbatterymonitor'
cask 'sookasa'
cask 'sourcetree'
cask 'spectacle'
cask 'spotdox'
cask 'steam'
cask 'sublime'
cask 'sublime-text'
cask 'suspicious-package'
cask 'teamviewer'
cask 'tether'
cask 'texshop'
cask 'texstudio'
cask 'textwrangler'
cask 'the-unarchiver'
cask 'thunderbird'
cask 'tower'
cask 'transmission'
cask 'transmit'
cask 'tresorit'
cask 'unison'
cask 'virtualbox'
cask 'vlc'
cask 'webpquicklook'
cask 'wireshark'
cask 'zotero'
mas 'Microsoft OneNote (15.28)', id: 784801555
mas 'AirBeam (2.2)', id: 442963716
mas 'Twitter (4.2.4)', id: 409789998
mas 'Tab for Google+ (3.2)', id: 449711125
mas 'Video Converter (2.5.0)', id: 412700130
mas 'McSolitaire (4.3)', id: 405728848
mas 'Growl (2.1.3)', id: 467939042
mas 'TweetDeck (3.9.889)', id: 485812721
mas 'SMARTReporter (3.1.11)', id: 509148961
mas 'Fantastic 4 In A Row Free (1.0.9)', id: 409248669
mas 'Disk Diag (1.4)', id: 672206759
mas 'Reeder (1.2)', id: 439845554
mas 'Elsewhere (1.3)', id: 512485834
mas 'CleanMyDrive 2 (2.1.3)', id: 523620159
mas 'iMovie (10.1.3)', id: 408981434
mas 'WhiteNoise (7.0)', id: 415139197
mas 'OneDrive (17.3.6518)', id: 823766827
mas 'Mint QuickView (2.0.1)', id: 533491939
mas 'Install OS X El Capitan (1.7.28)', id: 1018109117
mas 'DinosaurDots (1.5)', id: 980169201
mas 'iPhoto (9.6.1)', id: 408981381
mas 'NetSpot (1.3.418)', id: 514951692
mas 'Fireplace (1.2)', id: 407719809
mas 'Live Coloring Book (2.0)', id: 570169521
mas 'Duplicate Cleaner For iPhoto (1.13)', id: 586862299
mas 'DailyBible (1.0)', id: 407992094
mas 'Microsoft Remote Desktop (8.0.27228)', id: 715768417
mas 'DinosaurCombo (1.3.2)', id: 997591055
mas 'FruitsPuzzles (1.2)', id: 946386240
mas 'Prices Drop Monitor (4.5)', id: 473939551
mas 'DeskConnect (1.2.2)', id: 642220194
mas 'Textify Me (1.61)', id: 470453599
mas 'UnPlugged (3.0)', id: 423123087
mas 'Xcode (8.1)', id: 497799835
mas 'Doodle Hangman Free (1.0.13)', id: 409366914
mas 'ZooIsland (36.0.0)', id: 992143732
mas 'GarageBand (6.0.5)', id: 408980954
mas 'Kid's Activity Centre (1.2.2)', id: 644089060
mas 'Color by Numbers - Animals - Free (1.6)', id: 529870855
mas 'Pages (6.0.5)', id: 409201541
mas 'Numbers (4.0.5)', id: 409203825
mas 'PokerHD (1.1.1)', id: 408973905
mas 'BlackjackHD (1.1.1)', id: 408974874
mas 'Motion FX (1.1.4)', id: 449597246
mas 'Terrific Tic Tac Toe Free (1.0.4)', id: 409380380
mas 'Memory Clean (6.2)', id: 451444120
mas 'SSH Tunnel Manager (2.1.4)', id: 424470626
mas 'Keynote (7.0.5)', id: 409183694
mas 'SyncTime (2.5)', id: 590386474
mas '♡ Sudoku Daily (1.2)', id: 408895572
mas 'WiFi Explorer (2.2)', id: 494803304
mas 'Day One (2.1.3)', id: 1055511498
mas 'Pocket (1.6.2)', id: 568494494
